HomemadEtsy/app/controllers/application_controller.rb

    def test
      if params.has_key?(:login)
        login!(User.first)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]